{
	"personal": {
		"name": "Sergio",
		"title": "Software Quality Engineer",
		"tagline": "Turning bugs into features and chaos into quality! 🐛➡️✨",
		"email": "sergio.alballay@pm.me",
		"phone": "0430042591",
		"location": "Bathurst, NSW, Australia",
		"linkedin": "https://www.linkedin.com/in/sergio-alballay-mba-itm/",
		"github": "https://github.com/SergioAlballay",
		"website": "https://sergio.alballay.me"
	},
	"about": {
		"intro": "G'day! I'm Sergio, a cybersecurity-minded software quality engineer with 8+ years of experience turning chaos into quality. Born and raised in Chile, I moved to the US when I was 14 and recently made Australia my home about 2 years ago. Based in beautiful New South Wales, I've spent my career bridging the gap between \"it works on my machine\" and \"it works everywhere, securely, and at scale\".My multicultural journey has taken me from the factory floors of Mars Petcare to the cloud infrastructure of Western Governors University, always with one mission: ensuring software doesn't just work, but works brilliantly. I believe in automation, love Linux servers, and have an unhealthy obsession with making CI/CD pipelines purr like well-tuned engines. When I'm not hunting bugs or architecting test frameworks, you'll find me mentoring aspiring techies in my bilingual community programs, because great software is built by great teams.",
		"professionalSummary": "Results-driven Senior Software Quality Engineer with 6+ years of experience designing and leading enterprise-scale quality engineering programs. Proven record of transforming manual and siloed testing into highly automated, secure, and data-driven practices that accelerate delivery, improve reliability, and cut costs. Adept at bridging QA, DevOps, and cybersecurity disciplines, mentoring cross-functional teams, and embedding shift-left, risk-based, and CI/CD-first testing strategies across cloud-native and legacy ecosystems.",
		"workWithMe": [
			"🎯 I'm not just a tester – I'm a quality advocate. I don't just find bugs; I prevent them. I don't just write test cases; I build quality cultures.",
			"💼 Business-Focused: Every technical decision ties back to business value. I translate between \"developer speak\" and \"business speak\" fluently, making everyone's life easier",
			"🎓 Learning & Mentoring Enthusiast: I'm always excited to dive into new technologies and love bringing others along for the journey – best discoveries happen when we learn together",
			"🌐 Cybersecurity Mindset: I approach quality with a security-first perspective, ensuring software is not just functional but also secure and resilient",
			"💻 Naturally Curious Tester: My exploratory testing approach comes from genuine curiosity—I love poking around applications to see what breaks, what works unexpectedly well, and what users might actually do (vs. what we think they'll do).",
			"☕ Coffee Connoisseur: My code quality is directly proportional to my caffeine intake. I've tested this hypothesis extensively."
		],
		"funFacts": [
			"💻 I love my tech, I enjoy my free time working on software dev, automation and cloud engineering projects, learning new tech is my passion.",
			"🇨🇱 Born and raised in Chile, and lived in Arica, spent some time in  Santiago and Vina del Mar. ",
			"🇺🇸 Moved to the US at 14, lived in Utah, did not speak a word of english!",
			"⛷ I love skiing; I almost threw myself from a cliff once. I'm terrible at it and only stick to bunny slopes.",
			"🥩 I love cooking! anything that’s baked or in the grill, I’m the man for it. I also follow recipes from the internet sometimes... but they don’t always work.",
			"🎭 Protagonist Personality (ENFJ-A): Turns out I'm wired to be an inspiring optimist who loves helping others achieve their goals – which explains why I can't stop mentoring people and building quality cultures! "
		],
		"personality": [
			"Detail-oriented perfectionist with a sense of humor",
			"Collaborative team player who loves mentoring",
			"Continuous learner always exploring new testing tools",
			"Problem solver who sees challenges as puzzles to solve"
		]
	},
	"skills": {
		"technical": [
			"Test Automation & CI/CD - I design automated testing frameworks for APIs, UI, and end-to-end workflows, integrated into pipelines for quality gates and fast feedback.",
			"Test Strategy & Management - I establish test planning, execution tracking, and defect management processes that provide clear visibility into quality and release readiness.",
			"Performance Validation - I conduct load and stress testing to verify applications handle expected volumes and identify bottlenecks before they impact users.",
			"Quality Leadership - I've driven enterprise quality transformations, establishing standards, mentoring teams, and implementing metrics that improve software reliability.",
			"Secure Development - I integrate security testing into quality processes and work with cloud infrastructure to ensure applications meet security and compliance requirements.",
			"Production Quality - I implement monitoring and alerting systems that provide real-time application health insights and enable rapid incident response."
		],
		"soft": [
			"Bilingual bridge-builder (Spanish & English)",
			"Team energizer – I thrive on collaboration and lifting others up",
			"Clear communicator – I translate tech jargon into human (and vice versa)",
			"Analytical thinker – I dissect problems and find elegant solutions",
			"Calm problem-solver – Conflicts don’t scare me; I help teams find common ground",
			"Adaptable learner – New tech? Changing priorities? I pivot with curiosity",
			"Curious explorer – I love diving deep into applications to uncover hidden issues and unexpected behaviors",
			"Empathetic mentor – I enjoy learning as I share knowledge and help others grow in their careers."
		],
		"techResume": [
			"Test Automation Frameworks: Python (pytest), JavaScript (Cypress), Java (Selenium), Postman/Newman, Playwright",
			"Testing Types: Unit, Integration, Functional, Regression, Exploratory, User Acceptance Testing (UAT), API, Mobile, Accessibility, Performance (load/stress), Security, Contract, Smoke, Chaos testing",
			"Performance & Observability: JMeter, k6, Dynatrace, New Relic, OpsGenie",
			"CI/CD & DevOps: GitHub Actions, Jenkins, Docker, Kubernetes, AWS",
			"Security-Focused QA: CompTIA Security+, API security (OWASP Top 10), MITRE ATT&CK, fuzzing, SAST/DAST, governance/policy development",
			"Test Management: Jira Xray, qTest, ServiceNow test management",
			"Languages/Scripting: Python, JavaScript, Java, Bash, SQL",
			"OS: Linux (Debian and Red Hat based), Windows, macOS",
			"Change & Process: Agile (Scrum, SAFe), ITIL, ADKAR, BDD/TDD, risk-based, shift-left",
			"Version Control: Git, GitHub, GitLab, Bitbucket",
			"Other: SCADA, PLC, Power BI, Weever"
		]
	},
	"experience": [
		{
			"title": "Smart Factory Technician",
			"company": "Mars Petcare",
			"duration": "03/2024 - Present (Contract)",
			"description": "As a Smart Factory Technician, I drove digital transformation initiatives to modernise operational workflows, improve data visibility, and bridge the gap between factory operations and leadership. As a strategic liaison across teams, I combined technical expertise, change management leadership, and frontline engagement to successfully deliver cross-functional digitalisation projects within Mars Petcare’s manufacturing environment.",
			"achievements": [
				"Lead digital transformation initiatives using Weever Forms & Process to digitise quality checks, automate workflows, and enable real-time operational visibility.",
				"Collaborate with operators, QA/Food Safety, and focused improvement teams to design forms and dashboards that drive compliance and performance insights.",
				"Integrate process data into Power BI to track missed checks, action items, and trends, supporting data-informed decisions.",
				"Oversee capital funding requests, budget tracking, and project rollout planning for factory digitisation efforts.",
				"Apply ADKAR-based change management strategies to ensure smooth adoption and ongoing support.",
				"Coordinate cross-functional communications to support project awareness, user engagement, and continuous improvement.",
				"Act as a liaison between factory operators, management, and leadership, gathering frontline feedback, communicating operational needs, and ensuring user-centric improvements are integrated into digital initiatives.",
				"Lead Changeover Optimiser project to reduce product-switch time, minimising waste and downtime.",
				"Drive Giveaway Control initiative to reduce packaging overfill by implementing e-weight systems and feedback loops."
			]
		},
		{
			"title": "Senior Software Quality Engineer",
			"company": "Western Governors University",
			"duration": "Jul 2018 – Dec 2023",
			"description": "As a Senior Software Engineer within the Quality Engineering team, I drove enterprise-wide modernization initiatives focused on automation, secure software development, incident response support, and infrastructure transformation. Serving as a technical leader and security advocate, I bridged quality engineering, cybersecurity, and DevOps practices to optimize system resilience, streamline operations, and promote a security-first culture across development teams.",
			"achievements": [
				"Led enterprise-wide QA modernization, developing and maintaining automation frameworks for UAT/API using Python, Postman, Newman, Selenium, Cypress, enhancing test coverage and reducing manual effort.",
				"Drove migration and standardization of 5,000+ test cases into Jira Xray, fostering comprehensive reporting, traceability, and analytics across multiple test management platforms (qTest, ServiceNow).",
				"Automated test reporting, integrated with CI/CD (GitHub Actions, Docker, Kubernetes, AWS EC2), and streamlined defect tracking.",
				"Standardized and championed load and performance testing for APIs and databases using JMeter/k6, diagnosing and resolving core system bottlenecks.",
				"Modernized source control and automation through Bitbucket-GitHub migration, IAM workflow automation, and AWS S3 backups.",
				"Integrated and educated teams on implementing security best practices (SAST, DAST, OWASP, MITRE), governance, and AI/data privacy awareness.",
				"Provided technical leadership during the transition of observability platforms (New Relic to Dynatrace), developed incident alert profiles, and participated in 24/7 on-call rotations."
			]
		},
		{
			"title": "Software Quality Assurance Engineer",
			"company": "Western Governors University",
			"duration": "Jun 2017 – Jul 2018",
			"description": "Conducted manual and automated testing for web applications, ensuring high quality and performance standards.",
			"achievements": [
				"Orchestrated end-to-end SIT, UAT, and regression testing, covering mobile (iOS/Android), web, and backend layers.",
				"Authored and executed rigorous test plans, managed data integrity via SQL validation, and programmatically migrated test assets between management platforms.",
				"Led adoption of performance and load testing methodologies for REST APIs and database integrations."
			]
		},
		{
			"title": "Client Relationship Manager",
			"company": "SPS Servicing",
			"duration": "Aug 2015 – Jun 2016",
			"description": "Empowered homeowners through personalized mortgage retention strategies, driving financial recovery outcomes and customer success.",
			"achievements": [
				"Managed bilingual communications with distressed borrowers, closing $500K+/month in loss mitigation outcomes.",
				"Built strong relationships with clients by negotiating terms aligned to regulatory requirements and personal financial goals.",
				"Maintained meticulous case documentation to ensure legal compliance and operational transparency"
			]
		},
		{
			"title": "Support Engineer",
			"company": "CSS Corporation",
			"duration": "May 2015 – August 2015",
			"description": "Specialized in active directory management, and provided remote assistance for virus and malware removal from company devices",
			"achievements": [
				"Provided bilingual Tier 1 technical support to global customers, assisting with installations, virus remediation, and system configuration.",
				"Resolved AD and SSO password reset issues.",
				"Full system maintenance, including windows/mac/linux reinstallations, software updates, virus removal,and hardware troubleshooting."
			]
		},
		{
			"title": "Problem Resolution Specialist",
			"company": "ARUP Laboratories",
			"duration": "May 2007 – February 2015",
			"description": "Specialized in Genetics, accepted and ensured specimen integrity for karyotyping",
			"achievements": [
				"Coordinated international and non-client genetic test requests, generating $30K+/month.",
				"Maintained documentation in MasterControl and acted as weekend department lead.",
				"Resolved sample submission issues for genetic testing by coordinating with physicians, medical directors, genetic counsellors and labs. Trained new hires on laboratory procedures and quality standards."
			]
		}
	],
	"education": [
		{
			"degree": "Bachelor of Science in Computer Science",
			"school": "Western Governors University",
			"year": "2019",
			"details": "Relevant coursework: Managing orgs and leading people, managing human capital, and ethical leadership,IT project management, IT strategic solutions, and Data driven decision making, Marketing, finance, accounting, and global economics"
		},
		{
			"degree": "Masters of Business, IT Management",
			"school": "Western Governors University",
			"year": "2019",
			"details": "Relevant coursework: Web Development (JS and Python), SQL Data Management, Java, Android Development, IT fundamentals, Leadership and Management, Technical Writing, Business of IT, Network and Security"
		}
	],
	"certifications": [
		"CompTIA Security+",
		"CompTIA Project +",
		"ITIL Foundations IT Service Management – Aexios",
		"AWS Certified Developer – Associate",
		"AWS Certified Cloud Practitioner",
		"CIW Advanced HTML5 and CSS3 Specialist",
		"CIW Site Development Associate",
		"CIW User Interface Designer",
		"The Iron Yard Front End Engineering Certification",
		"CompTIA A+"
	],
	"projects": [
		{
			"name": "E-commerce Testing Suite",
			"description": "Comprehensive automated testing framework for online shopping platform",
			"technologies": ["Selenium", "Python", "Jenkins"],
			"impact": "Reduced regression testing time from 2 days to 4 hours"
		},
		{
			"name": "Mobile App Quality Dashboard",
			"description": "Real-time quality metrics dashboard for mobile applications",
			"technologies": ["Appium", "JavaScript", "React"],
			"impact": "Improved mobile app stability by 35%"
		}
	]
}
